anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
#include "APP/APP.h"
#ifdef APP
#if (APP==APP10_DEMO1)
/*
 * File Name: Time_DateApp.c
 * Layer	: App
 * Version  : V 0.0
 * Created	: Apr 8, 2024
 * Author1 	: Yasmin Amr
 * Author2  : Anas Khamees
 */

/**********************************************************************************/
/*										Includes				     			  */
/**********************************************************************************/
#include "MCAL/UART/USART.h"
#include "MCAL/GPIO/GPIO.h"
#include "MCAL/NVIC/NVIC.h"
#include "MCAL/NVIC/STM32F401xx.h"
#include "MCAL/UART/USART.h"
#include "HAL/PeripheralCLK_Control/CLK_Control.h"
#include "HAL/LCD_Scheduler/LCD.h"
#include "Scheduler/Scheduler.h"

/***********************************************************************************/
/*										Defines									   */
/***********************************************************************************/

/*============================ Control Switches ============================*/
/* Anas change the switchs order and values to optimize Switchs number*/

#define OK                          '1' 
#define MODE                        '1'

#define UP                          '2'
#define EDIT                        '3'

#define RIGHT                       '4'
#define START_STOP_STOPWATCH        '4' 

#define LEFT                        '5'
#define RESET_STOPWATCH             '5'

#define PAUSE_CONTINUE_STOPWATCH    '6'
#define DOWN                        '6'

/*==================== LCD Screen Current Mode ============================*/
#define MainMenu                    0
#define StopWatch                   1
#define DateTime                    2
/*==================  Defines Represent LCD Lines (Rows) ==================*/
#define FirstLine                   0
#define SecondLine                  1
/*================= Defines Represent EditMode is ON/OFF ==================*/
#define ON                          1
#define OFF                         0
/*=========================================================================*/
#define CONSTANT                    0
#define MODIFIED                    1

#define DATE_TIME_INDEX 6
/*======================== Time Digits on LCD ===========================*/
#define HOURS_INDEX1    6    
#define HOURS_INDEX2    7
#define MINUTES_INDEX1  9
#define MINUTES_INDEX2  10
#define SECONDS_INDEX1  12
#define SECONDS_INDEX2  13
/*======================== Date Digits on LCD ===========================*/
#define DAY_INDEX1      6
#define DAY_INDEX2      7
#define MONTH_INDEX1    9
#define MONTH_INDEX2    10
#define YEAR_INDEX1     12
#define YEAR_INDEX2     13
#define YEAR_INDEX3     14
#define YEAR_INDEX4     15
/*========================= StopWatch Modes =============================*/
#define STOP_WATCH_PAUSE            0
#define STOP_WATCH_CONTINUE         1
#define STOP_WATCH_RESET_ON         2
#define STOP_WATCH_RESET_OFF        3
#define STOP_WATCH_START            4
#define STOP_WATCH_STOP             5
/************************************************************************************/
/*									Variables									    */
/************************************************************************************/
uint8_t buffer=0;                        /* Var to Save Received Data From UART                           */
uint8_t CurrentMode= MainMenu;           /* Var represent the Current mode to Display on LCD              */
uint8_t MainMenuCursorLoc=FirstLine;     /* Var to store the Current location of Cursor in Main Menu Mode */
/*======================= Variables of Date =========================*/
uint8_t Day=10;
uint8_t Month=4;
uint16_t Year=2024;
/*===================== LCD Operation States =======================*/
uint8_t EditMode=OFF;                   /*Variable to Keep Track if Editing is On/Off to Enable/Disable Cursor*/

uint8_t PosX=FirstLine;                 /*Variable to Keep Track of LCD Cursor Column Position During Editing*/
uint8_t PosY=DATE_TIME_INDEX;           /*Variable to Keep Track of LCD Cursor Row Position During Editing*/

uint8_t ModeState=CONSTANT;             /*Variable to Keep Track if a Mode is Changed to Date&Time or Stopwatch*/
uint8_t EditUpdate=CONSTANT;            /*Variable to Keep Track if an Increment/Decrement in Date or Time has Happened*/

/*============================ Time Variables ==============================*/
uint32_t TimeSeconds=30;
uint32_t TimeMinutes=59;
uint32_t TimeHours=0;
/*========================= StopWatch Variables ============================*/
uint8_t StopWatchTensSeconds=0;
uint8_t StopWatchSeconds=0;
uint8_t StopWatchMinutes=0;
uint8_t StopWatchHours=0;

uint8_t StopWatchStartStop=STOP_WATCH_STOP;
uint8_t StopWatchPauseContinue=STOP_WATCH_CONTINUE;
uint8_t StopWatchReset=STOP_WATCH_RESET_OFF;

/*************************************************************************************/
/*							Static Functions Prototype								 */
/*************************************************************************************/
 static void LCD_ShiftRight(void);
 static void LCD_ShiftLeft(void);
 static void LCD_DisplayMainMenu(void);
 static void LCD_IncrementDateTime(void);
 static void LCD_DecrementDateTime(void);
 static void USART_ReceiveCbf(void);

/************************************************************************************/
/*                            Static APIs Implementation						    */
/************************************************************************************/
static void LCD_ShiftRight(void)
{
    /* If the Cursor now,In the most Right of First Line and ShiftRight is Triggered, 
     * The cursor will move to the most Right in the Second Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
     if(PosY==SECONDS_INDEX2&&PosX==FirstLine)
    {
        PosX=SecondLine;
        PosY=YEAR_INDEX4; /* Anas Edit this */
    }
    /* If the Cursor now,In the most Right of SecondLine and ShiftRight is Triggered, 
     * The cursor will move to the most Right in the First Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
    else if(PosY==YEAR_INDEX4&&PosX==SecondLine)
    {
        PosX=FirstLine;
        PosY=SECONDS_INDEX2;  /* Anas Edit this */
    }
    else
    {
        PosY++;
    }
    LCD_SetCursorPosAsynch(LCD1,PosX,PosY,NULL);
}

static void LCD_ShiftLeft(void)
{
    /* If the Cursor now,In the most Left of First Line and ShiftLeft is Triggered, 
     * The cursor will move to the most Left in the Second Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
    if(PosY==HOURS_INDEX1&&PosX==FirstLine)
    {
        PosX=SecondLine;
        PosY=DAY_INDEX1; /* Anas Edit This */
    }
    /* If the Cursor now,In the most Left of Second Line and ShiftLeft is Triggered, 
     * The cursor will move to the most Left in the First Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
    else if(PosY==DAY_INDEX1&&PosX==SecondLine)
    {
        PosX=FirstLine;
        PosY=HOURS_INDEX1; /* Anas Edit This */
    }
    else
    {
        PosY--;
    }
    LCD_SetCursorPosAsynch(LCD1,PosX,PosY,NULL);
}

static void LCD_DisplayMainMenu(void)
{
    /* Display "Date and Time"    */
    LCD_SetCursorPosAsynch(LCD1,FirstLine,0,NULL);
    LCD_WriteStringAsynch(LCD1,"1.Date and Time",15,NULL);
    /* Display "Stopwatch"        */
    LCD_SetCursorPosAsynch(LCD1,SecondLine,0,NULL);
    LCD_WriteStringAsynch(LCD1,"2.Stopwatch",11,NULL);
    /* Return Cursor to Beginning */
    LCD_SetCursorPosAsynch(LCD1,FirstLine,0,NULL);
}

static void LCD_IncrementDateTime(void)
{

