anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
/*------------------------------------------------------------*/
/*---------------------- Edit in Date ------------------------*/
/*------------------------------------------------------------*/
    
    uint8_t DayIndex1  =(Day/10)       ;
    uint8_t DayIndex2  =(Day%10)       ;
    uint8_t MonthIndex1=(Month/10)     ;
    uint8_t MonthIndex2=(Month%10)     ;
    uint8_t YearIndex1 =Year/1000      ;  /* Thousands place */
    uint8_t YearIndex2 =(Year%1000)/100;  /* Hundreds place  */
    uint8_t YearIndex3 =(Year%100)/10  ;  /* Tens place      */
    uint8_t YearIndex4 =Year%10        ;  /* Ones place      */
    
    /*-------------------- Edit DayIndex1 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX1))
    {
        /* Ex: If Day is 30 or 31 and digit (3) triggered to Increment to be 4,5..(Not Allowed: Meaningless) */
        if(DayIndex1==3)
        {
           /* CornerCase: If I Edit Index2 First before editing Index1 (ex:DayIndex1=3,,DayIndex2=0) 
            * and DayIndex1 triggered to increment.. DayIndex1 will be (1).
            * beacause There is no day called 00,,, (30 ---> 10)
            */
            if(DayIndex2==0)
            {
                DayIndex1=1;
            }
            /* Ex: If Month is 31 ----will be----> 01 */
            else
            {
                DayIndex1=0;
            }
        }
         
        else  
        {
            DayIndex1++;
            /* CornerCase: If User Edit DayIndex2 Before DayIndex1 
             * Ex: Day = 31, and user increment DayIndex2 (1) to be 2,3,4....
             * DayIndex1 Must be Cleared (0) because Day: 32, 33,34 Not Allowed.
             * But Day will be ------------------->  Day: 02, 03,04 .
             */
            if((DayIndex1==3)&&(DayIndex2>1))
            {
                DayIndex2=0;
            }
        }
    }
    /*-------------------- Edit DayIndex2 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX2))
    {
        /**
         * If the Day is 31, and DayIndex2 triggered to increment (32,33), Meaningless.
         */
        if((DayIndex1==3)&&(DayIndex2==1)) 
        {
            DayIndex2=0;
        }
        if(DayIndex2==9)
        {
           /* CornerCase: If I Edit Index1 First before editing Index2 (ex:DayIndex1=0,,DayIndex2=9) 
            * and DayIndex2 triggered to increment.. DayIndex2 will be (1) NOT (0).
            * beacause There is no day called 00,,, (09 ---> 01)
            */
            if(DayIndex1==0)
            {
            DayIndex2=1;
            }
            /* Ex: Day is 29 -----Will be------> 20 */
            else
            {
                DayIndex2=0;
            }
        }
        else 
        {
            DayIndex2++;
        }
    }
    /*---------------- Edit MonthIndex1 -----------------*/
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX1))
    {
        if(MonthIndex1==1)
        {
           /* CornerCase: If I Edit Index2 First before editing Index1 (ex:MonthIndex1=1,,MonthIndex2=0) 
            * and DayIndex1 triggered to increment.. MonthIndex1 will remain (1) Not (9 or 0).
            * beacause There is no Month called 00 or 90 ,,, (10 ---> 10).
            */
            if(MonthIndex2==0)
            {
                MonthIndex1=1;
            }
            /* Ex: Month is 12 ----will be----> 02 */
            else
            {
                MonthIndex1=0;
            }
        }
        else if(MonthIndex2<=2)  /* Months 10 - 11 - 12  Only */
        {
            MonthIndex1++;
        }
    }
    /*------------------ Edit MonthIndex2 ------------------*/
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX2))
    {
        if(MonthIndex2==9)
        {
           /* CornerCase: If I Edit Index1 First before editing Index2 (ex:MonthIndex1=0,,MonthIndex2=9) 
            * and MonthIndex2 triggered to increment.. MonthIndex2 will be (1) NOT (0).
            * beacause There is no Month called 00,,, (09 ---> 01)
            */
         MonthIndex2=1;

        }
        /* CornerCase:
         * Ex: Months: 10,11,12.. If MonthIndex2 Triggered to Increments to be 13,14...Meaningless.
         * So, MonthIndex2 must be cleared (0).
         */
        else if((MonthIndex2==2) &&(MonthIndex1==1))
        {
            MonthIndex2=0;            
        }
        else
        {
            MonthIndex2++;
        }
    }

    /*---------------------------------------------------------------*/
    /*------- Don't Edit in YearIndex1, YearIndex2  Meaningless -----*/
    /*---------------------------------------------------------------*/

    /*------------------- Edit YearIndex3 ---------------------*/
    if((PosX==SecondLine)&&(PosY==YEAR_INDEX3))
    {
        if(YearIndex3==9)
        {
            YearIndex3=0;
        }
        else
        {
            YearIndex3++;
        }
    }
    /*------------------- Edit YearIndex4 ---------------------*/
     if((PosX==SecondLine)&&(PosY==YEAR_INDEX4))
    {
        if(YearIndex4==9)
        {
            YearIndex4=0;
        }
        else
        {
            YearIndex4++;
        }
    }

/*======================= Date Updated Values =========================*/
    Day  =((DayIndex1*10)+DayIndex2);
    Month=((MonthIndex1*10)+MonthIndex2);
    Year =((YearIndex1*1000)+(YearIndex2*100)+(YearIndex3*10)+(YearIndex4));
/*=====================================================================*/
    
/*----------------------------------------------------------------*/
/*-------------------------- Edit in Time ------------------------*/
/*----------------------------------------------------------------*/
    uint8_t TimeHoursIndex1  = (TimeHours/10)  ;
    uint8_t TimeHoursIndex2  = (TimeHours%10)  ;
    uint8_t TimeMinutesIndex1= (TimeMinutes/10);
    uint8_t TimeMinutesIndex2= (TimeMinutes%10);  
    uint8_t TimeSecondsIndex1= (TimeSeconds/10);
    uint8_t TimeSecondsIndex2= (TimeSeconds%10);  

    /*------------------- Edit Hours Index 1 ---------------------*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX1)
    {
        /* Corner Case:
         * Time cant get past 23:59:59, So Hours can't be greater than 23
         * Incrementing "TimeHoursIndex1" to '2' while "TimeHoursIndex2" is greater than 3 is not allowed 
         * The Implementation of this function is to increment till the last digit then circulate.
         * Ex: 0,1,2,0,1,2,0,1,.....
         * The line below is to assign "TimeHoursIndex1" to '0', as it is the next valid value in the sequence.
         */
        if((TimeHoursIndex1==1)&&(TimeHoursIndex2>3))
        {
            TimeHoursIndex1=0;
        }
        /*Max Clock Value is 23:59:59, so we Circulate "TimeHoursIndex1" to the next valid value*/
        else if(TimeHoursIndex1==2)
        {
            TimeHoursIndex1=0;
        }
        else
        {
            TimeHoursIndex1++;
        }
    }

    /*------------------- Edit Hours Index 2 ---------------------*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX2)
    {
        /*Max Clock Value is 23:59:59, so we Circulate "TimeHoursIndex2" to the next valid value*/
        if(TimeHoursIndex1==2&&TimeHoursIndex2==3)
        {
            TimeHoursIndex2=0;
        }
        else
        {
            if(TimeHoursIndex2==9)
            {
                TimeHoursIndex2=0;
            }
            else
            {
                TimeHoursIndex2++;
            }
        }

