anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
    }

    /*------------------- Edit Minutes Index 1 ---------------------*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX1)
    {
        if(TimeMinutesIndex1==5)
        {
            TimeMinutesIndex1=0;
        }
        else
        {
            TimeMinutesIndex1++;
        }
    }

    /*------------------- Edit Minutes Index 2 ---------------------*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX2)
    {
        if(TimeMinutesIndex2==9)
        {
            TimeMinutesIndex2=0;
        }
        else
        {
            TimeMinutesIndex2++;
        }
    }

    /*------------------- Edit Seconds Index 1 ---------------------*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX1)
    {
        if(TimeSecondsIndex1==5)
        {
            TimeSecondsIndex1=0;
        }
        else
        {
            TimeSecondsIndex1++;
        }
    }
    /*------------------- Edit Seconds Index 2 ---------------------*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX2)
    {
        if(TimeSecondsIndex2==9)
        {
            TimeSecondsIndex2=0;
        }
        else
        {
            TimeSecondsIndex2++;
        }
    }

/*============================ Time Updated Values ===================================*/
    TimeHours= (TimeHoursIndex1*10)+TimeHoursIndex2;
    TimeMinutes= (TimeMinutesIndex1*10)+TimeMinutesIndex2;
    TimeSeconds= (TimeSecondsIndex1*10)+TimeSecondsIndex2;
/*====================================================================================*/
    EditUpdate=MODIFIED; /*Update Global Variable that a Variable has been Incremented*/
}

static void LCD_DecrementDateTime(void)
{
/*-------------------------- Date ------------------------*/
    uint8_t DayIndex1  =(Day/10)       ;
    uint8_t DayIndex2  =(Day%10)       ;
    uint8_t MonthIndex1=(Month/10)     ;
    uint8_t MonthIndex2=(Month%10)     ;
    uint8_t YearIndex1 =Year/1000      ;  /* Thousands place */
    uint8_t YearIndex2 =(Year%1000)/100;  /* Hundreds place  */
    uint8_t YearIndex3 =(Year%100)/10  ;  /* Tens place      */
    uint8_t YearIndex4 =Year%10        ;  /* Ones place      */
    
    /*-------------------- Edit DayIndex1 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX1))
    {
        /**
         * IF Day is 01, and DayIndex1 (0) triggered to decrement,
         * The DayIndex1 will Be 3, So the day Will be 31. 
         */
        if((DayIndex1==0)&&(DayIndex2<2))
        {
            DayIndex1=3;
        }
        /* CornerCase: If I Edit Index2 First before editing Index1 (ex:DayIndex1=0 ,,, DayIndex2=5) 
         * and DayIndex1 triggered to decrement.. DayIndex1 will be (2) NOT (3).
         * beacause There is no day called 35,,, (05 ---> 25)
         */
        else if((DayIndex1==0)&&(DayIndex2>1))
        {
            DayIndex1=2;
        }
        /* CornerCase: If I Edit Index2 First (ex: DayIndex1=1 ,, DayIndex2=0) 
         * and DayIndex1 triggered to decrement.. DayIndex1 will be (3) NOT (9).
         * beacause There is no day called 90,,, (10 -----will be-----> 30).
         */
        else if((DayIndex1==1)&&(DayIndex2==0))
        {
            DayIndex1=3;            
        }
        else 
        {
            DayIndex1--;
        }
    }
    /*-------------------- Edit DayIndex2 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX2))
    {
        /* Ex: If Day is 10 or 20, and DayIndex2(0) triggered to Decrement, 
         * DayIndex2 will be 9 ,Day 10 ---> Day 19 and Day 20 -----> 29.
         */
        if((DayIndex2==0)&&(DayIndex1<3))
        {
            DayIndex2=9;
        }
        /* Ex: If Day is 30 , and DayIndex2(0) triggered to Decrement, 
         * DayIndex2 will be 1 ,Day 30 ---> 31.
         */
        else if((DayIndex2==0)&&(DayIndex1==3))
        {
            DayIndex2=1;
        }
        /* CornerCase: If I Edit Index1 First (ex:DayIndex1=0,,DayIndex2=1) 
         * and DayIndex2 triggered to decrement.. DayIndex2 will be (9).
         * beacause There is no day called 00,,, (01 ---> 09)
         */
        else if((DayIndex1==0)&&(DayIndex2==1))
        {
            DayIndex2=9;
        }
        else
        {
            DayIndex2--;
        }
    }
    /*---------------------- Edit MonthIndex1 -------------------*/
   
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX1))
    {
        /* Ex: If Month :01 or 02, and MonthIndex1 triggered to decrement
         * MonthIndex1 will be 1.... 01 ---> 11 / 02 ---> 12.
         */
        if((MonthIndex1==0)&&(MonthIndex2<3))
        {
            MonthIndex1=1;
        }
        /* Ex: If Month :03,04,05..... and MonthIndex1 triggered to decrement
         * MonthIndex1 will be 0 .... 03 ---> 03 / 04 ---> 04 .
         * Because Month 13, 14, 15 ... Not Allowed.
         */
        else if((MonthIndex1==0)&&(MonthIndex2>=3))
        {
            MonthIndex1=0;
        }
        /* CornerCase: If I Edit Index2 First before editing Index1 (ex: MonthIndex1=1 ,, MonthIndex2=0) 
         * and MonthIndex1 triggered to decrement.. MonthIndex1 will be (1) NOT (0 or 9).
         * beacause There is no Month called 00 or 90,,, (10 ---> 10)
         */
        else if ((MonthIndex1==1)&&(MonthIndex2==0))
        {
            MonthIndex1=1;
        }
        else 
        {
            MonthIndex1--;
        }
    }
    /*-------------------- Edit MonthIndex2 ------------------*/
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX2))
    {
        /* Ex: If Month is 01 and MonthIndex1 triggered to decrement
         * Month will be 00 (Not Allowed), if triggered to decrement again.
         * MonthIndex2 will be 9... 00 -----> 09
         */
        if((MonthIndex1==0)&&(MonthIndex2==0))
        {
            MonthIndex2=9;
        }
        /**
         * Ex : If Month is 10 and  MonthIndex2 triggered to decrement 
         * MonthIndex2 will be 2,,,, 10 -----> 12
         */
        else if((MonthIndex2==0)&&(MonthIndex1==1))
        {
            MonthIndex2=2; /*Month 12*/
        }
        /* CornerCase: If I Edit Index1 First before editing Index2 (ex:MonthIndex1=0,,MonthIndex2=1) 
         * and MonthIndex2 triggered to decrement.. MonthIndex2 will be (9) NOT (0).
         * beacause There is no Month called 00,,, (01 ---> 09)
         */
        else if((MonthIndex2==1)&&(MonthIndex1==0))
        {
            MonthIndex2=9;
        }
        else
        {
            MonthIndex2--;
        }
    }

