anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
    /*------- Don't Edit in YearIndex1, YearIndex2  Meaningless -----*/
    /*------------------- Edit YearIndex3 ---------------------*/
    if((PosX==SecondLine)&&(PosY==YEAR_INDEX3))
    {
        if(YearIndex3==0)
        {
            YearIndex3=9;
        }
        else
        {
            YearIndex3--;
        }
    }
    /*------------------- Edit YearIndex4 ---------------------*/
     if((PosX==SecondLine)&&(PosY==YEAR_INDEX4))
    {
        if(YearIndex4==0)
        {
            YearIndex4=9;
        }
        else
        {
            YearIndex4--;
        }
    }

/*============================ Date Updated Values ===================================*/
    Day  =((DayIndex1*10)+DayIndex2);
    Month=((MonthIndex1*10)+MonthIndex2);
    Year =((YearIndex1*1000)+(YearIndex2*100)+(YearIndex3*10)+(YearIndex4));
/*====================================================================================*/

    /*-------------------------- Time ------------------------*/
    uint8_t TimeHoursIndex1  = (TimeHours/10)  ;
    uint8_t TimeHoursIndex2  = (TimeHours%10)  ;
    uint8_t TimeMinutesIndex1= (TimeMinutes/10);
    uint8_t TimeMinutesIndex2= (TimeMinutes%10);  
    uint8_t TimeSecondsIndex1= (TimeSeconds/10);
    uint8_t TimeSecondsIndex2= (TimeSeconds%10);  

    /*------------------- Edit Hours Index 1 ---------------------*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX1)
    {
        /* Corner Case:
         * Time cant get past 23:59:59, So Hours can't be greater than 23
         * If "TimeHoursIndex1" = '0', Decrementing is would circulate the variable to '2' 
         * "TimeHoursIndex1" being '2' while "TimeHoursIndex2" is greater than 3 is not allowed
         * The Implementation of this function is to decrement till the last digit then circulate.
         * Ex: 2,1,0,2,1,0,2,1,.....
         * The line below is to assign "TimeHoursIndex1" to '1', as it is the next valid value in the sequence.
         */
        if((TimeHoursIndex1==0)&&(TimeHoursIndex2>3))
        {
            TimeHoursIndex1=1;    
        }
        /*Max Clock Value is 23:59:59, so we Circulate "TimeHoursIndex1" to the next valid value*/
        else if(TimeHoursIndex1==0)
        {
            TimeHoursIndex1=2;
        }
        else
        {
            TimeHoursIndex1--;
        }
        
    }

    /*------------------- Edit Hours Index 2 ---------------------*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX2)
    {
        /*Max Clock Value is 23:59:59, so we Circulate "TimeHoursIndex2" to the next valid value*/
        if(TimeHoursIndex1==2&&TimeHoursIndex2==0)
        {
            TimeHoursIndex2=3;
        }
        else
        {
            if(TimeHoursIndex2==0)
            {
                TimeHoursIndex2=9;
            }
            else
            {
                TimeHoursIndex2--;
            }
        }

    }

    /*------------------- Edit Minutes Index 1 ---------------------*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX1)
    {
        if(TimeMinutesIndex1==0)
        {
            TimeMinutesIndex1=5;
        }
        else
        {
            TimeMinutesIndex1--;
        }
    }

    /*------------------- Edit Minutes Index 2 ---------------------*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX2)
    {
        if(TimeMinutesIndex2==0)
        {
            TimeMinutesIndex2=9;
        }
        else
        {
            TimeMinutesIndex2--;
        }
    }

    /*------------------- Edit Seconds Index 1 ---------------------*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX1)
    {
        if(TimeSecondsIndex1==0)
        {
            TimeSecondsIndex1=5;
        }
        else
        {
            TimeSecondsIndex1--;
        }
    }

    /*------------------- Edit Seconds Index 2 ---------------------*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX2)
    {
        if(TimeSecondsIndex2==0)
        {
            TimeSecondsIndex2=9;
        }
        else
        {
            TimeSecondsIndex2--;
        }
    }

/*============================ Time Updated Values ===================================*/
    TimeHours= (TimeHoursIndex1*10)+TimeHoursIndex2;
    TimeMinutes= (TimeMinutesIndex1*10)+TimeMinutesIndex2;
    TimeSeconds= (TimeSecondsIndex1*10)+TimeSecondsIndex2;
/*====================================================================================*/
    EditUpdate=MODIFIED; /*Update Global Variable that a Variable has been Decremented*/
}
 
static void USART_ReceiveCbf(void)
{
    switch(CurrentMode)
    {
        case MainMenu:
        {
            switch(buffer)
            {
                case UP:
                {
                   LCD_SetCursorPosAsynch(LCD1,FirstLine,0,NULL);
                   /*Cursor Pointing to Date&Time*/  
                   MainMenuCursorLoc=FirstLine;
                }
                break;
                case DOWN:
                {
                   LCD_SetCursorPosAsynch(LCD1,SecondLine,0,NULL);
                    /*Cursor Pointing to Stopwatch*/  
                   MainMenuCursorLoc=SecondLine;
                }
                break;
                case OK:
                {
                    /*Disable Cursor to only View What's Selected*/
                    LCD_DisableCursorAsynch(LCD1,NULL);
                    if(MainMenuCursorLoc==FirstLine)
                    {
                        CurrentMode=DateTime;
                    }
                    else if(MainMenuCursorLoc==SecondLine)
                    {
                        CurrentMode=StopWatch;
                    }
                }
                break;
                default:
                {
                    //Do Nothing
                }
                break;
            }
        }
        break;
        case StopWatch:
        {
             switch(buffer)
            {
                case START_STOP_STOPWATCH:
                {
                    if(StopWatchStartStop==STOP_WATCH_STOP)
                    {
                        StopWatchStartStop=STOP_WATCH_START;
                    }
                    else if(StopWatchStartStop==STOP_WATCH_START)
                    {
                        StopWatchStartStop=STOP_WATCH_STOP;
                    }         
                }
                break;
                case RESET_STOPWATCH:
                {
                    StopWatchReset=STOP_WATCH_RESET_ON;
                }
                break;
                case PAUSE_CONTINUE_STOPWATCH:
                {
                    if(StopWatchPauseContinue==STOP_WATCH_CONTINUE)
                    {
                        StopWatchPauseContinue=STOP_WATCH_PAUSE;
                    }
                    else if(StopWatchPauseContinue==STOP_WATCH_PAUSE)
                    {
                        StopWatchPauseContinue=STOP_WATCH_CONTINUE;
                    }
                }
                break;
                case EDIT:
                {
                    /* No Edits in StopWatch */
                }
                break;
                case MODE:
                {
                    CurrentMode=DateTime;
                    ModeState=MODIFIED;
                }
                break;
            }       
        }
        break;
        case DateTime:
        {
            /*Initial Cursor State is Last Place it was At while Editing*/
            LCD_SetCursorPosAsynch(LCD1,PosX,PosY,NULL);
            switch(buffer)
            {
                case UP:
                {
                    if(EditMode==ON)
                    {
                        LCD_IncrementDateTime();
                    }
                }
                break;
                case DOWN:
                {
                    if(EditMode==ON)
                    {
                        LCD_DecrementDateTime();
                    }
                }
                break;
                case RIGHT:
                {
                    LCD_ShiftRight();
                }
                break;
                case LEFT:
                {
                    LCD_ShiftLeft();
                }
                break;
                case EDIT:
                {
                    if(EditMode==OFF)
                    {
                        EditMode=ON;
                        LCD_SetCursorPosAsynch(LCD1,FirstLine,0,NULL);  
                        LCD_EnableCursorAsynch(LCD1,NULL);
                    }
                    else if(EditMode==ON)
                    {
                        EditMode=OFF;
                        LCD_DisableCursorAsynch(LCD1,NULL);
                    }                   
                }
                break;
                case MODE:
                {
                    CurrentMode=StopWatch;
                    ModeState=MODIFIED;
                    /*Disable Editing Mode and Cursor (No Use in Stopwatch) */
                    LCD_DisableCursorAsynch(LCD1,NULL);
                    EditMode=OFF;
                }
                break;

