anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
            }
        }
        break;
    }
}

/***********************************************************************************/
/*								Application Runnables	   						   */
/***********************************************************************************/

/* Each 1000mS */
void LCD_DisplayDateTime(void)
 {
    static uint8_t First_Time=0;
    ErrorStatus_t ReturnError;
        if(EditMode==OFF)
        {
            TimeSeconds++;
            if (TimeSeconds > 59) 
            {
                TimeSeconds = 0;

                TimeMinutes++;
                if (TimeMinutes > 59) 
                {
                    TimeMinutes = 0;
                    TimeHours++;
                    if (TimeHours > 23) 
                    {
                        TimeHours = 0;
                    }
                }
            }
        }

        if(CurrentMode==DateTime)
        {
            /* First Function Entry            */
            if(First_Time==0)
            {
                LCD_ClearScreenAsynch(LCD1,NULL);
                First_Time++;
            }
            /* Clear LCD Screen if Mode is Changed to Stopwatch/DateTime */
            else if(ModeState==MODIFIED)
            {
                LCD_ClearScreenAsynch(LCD1,NULL);
                ModeState=CONSTANT; 
            }
            else
            {
                //Do Nothing
            }

            /* Updating Time&Date Values on the LCD will happen if
             * 1) "EditMode==OFF" : User isn't editing in Time/Date
             * 2) "EditUpdate==Modified" : User Requested an Increment/Decrement in one of the Time/Date Digits
             */
            if((EditMode==OFF)||(EditUpdate==MODIFIED)) 
            {   

                ReturnError=LCD_SetCursorPosAsynch(LCD1,FirstLine,0,NULL);
                ReturnError=LCD_WriteStringAsynch(LCD1,"Time: ",6,NULL);
                //ReturnError=LCD_SetCursorPosAsynch(LCD1,1,2,NULL);

                ReturnError=LCD_WriteNumAsynch(LCD1,TimeHours/10,NULL);
                ReturnError=LCD_WriteNumAsynch(LCD1,TimeHours%10,NULL); 
        
                ReturnError=LCD_WriteStringAsynch(LCD1,":",1,NULL);
                
                ReturnError=LCD_WriteNumAsynch(LCD1,TimeMinutes/10,NULL);
                ReturnError=LCD_WriteNumAsynch(LCD1,TimeMinutes%10,NULL);

                ReturnError=LCD_WriteStringAsynch(LCD1,":",1,NULL);
                
                ReturnError=LCD_WriteNumAsynch(LCD1,TimeSeconds/10,NULL);
                ReturnError=LCD_WriteNumAsynch(LCD1,TimeSeconds%10,NULL);

                ReturnError=LCD_SetCursorPosAsynch(LCD1,SecondLine,0,NULL);
                ReturnError=LCD_WriteStringAsynch(LCD1,"Date: ",6,NULL);

                ReturnError=LCD_WriteNumAsynch(LCD1,Day/10,NULL);
                ReturnError=LCD_WriteNumAsynch(LCD1,Day%10,NULL); 
         
                ReturnError=LCD_WriteStringAsynch(LCD1,"/",1,NULL);
                
                ReturnError=LCD_WriteNumAsynch(LCD1,Month/10,NULL);
                ReturnError=LCD_WriteNumAsynch(LCD1,Month%10,NULL);

                ReturnError=LCD_WriteStringAsynch(LCD1,"/",1,NULL);
                
                uint8_t YearThousandsDigit=Year/1000      ;  /* Thousands place */
                uint8_t YearHundredsDigit =(Year%1000)/100;  /* Hundreds place  */
                uint8_t YearTensDigit     =(Year%100)/10  ;  /* Tens place      */
                uint8_t YearOnesDigit     =Year%10        ;  /* Ones place      */
           
                ReturnError=LCD_WriteNumAsynch(LCD1,YearThousandsDigit,NULL); 
                ReturnError=LCD_WriteNumAsynch(LCD1,YearHundredsDigit,NULL);
                ReturnError=LCD_WriteNumAsynch(LCD1,YearTensDigit,NULL);
                ReturnError=LCD_WriteNumAsynch(LCD1,YearOnesDigit,NULL);
                

                if(EditUpdate==MODIFIED) /* Edit mode and Modification is Done*/
                {
                    EditUpdate=CONSTANT;

                    /* Printing Date and Time Above Moved the Cursor from the Digit it was At while User was Editing
                     * This Sets Cursor Back to its Place
                     */
                    LCD_SetCursorPosAsynch(LCD1,PosX,PosY,NULL);
                }
            }
        }
 }
 
/* Each 100mS */
void LCD_DisplayStopwatch()
{
    ErrorStatus_t ReturnError;
    static uint8_t First_Time=0;
    
    if(((StopWatchPauseContinue==STOP_WATCH_CONTINUE)&&
        (StopWatchStartStop==STOP_WATCH_START))&&(StopWatchReset==STOP_WATCH_RESET_OFF))
    {
        StopWatchTensSeconds++;

       if(StopWatchTensSeconds>9) 
       {
            StopWatchTensSeconds=0;
            StopWatchSeconds++;
            if (StopWatchSeconds > 59) 
            {
                StopWatchSeconds = 0;
                StopWatchMinutes++;
                if (StopWatchMinutes > 59) 
                {
                    StopWatchMinutes = 0;
                    StopWatchHours++;
                    if (StopWatchHours > 23) 
                    {
                        StopWatchHours = 0;
                    }
                }
            }
       }
    }
    else if (StopWatchReset==STOP_WATCH_RESET_ON)
    {
        StopWatchTensSeconds=0;
        StopWatchSeconds=0;
        StopWatchMinutes=0;
        StopWatchHours=0;
        StopWatchReset=STOP_WATCH_RESET_OFF;
    }
        
        if(CurrentMode==StopWatch)
        {
            if(First_Time==0)
            {
                LCD_ClearScreenAsynch(LCD1,NULL);
                First_Time++;
            } 
            else if(ModeState==MODIFIED)
            {
                LCD_ClearScreenAsynch(LCD1,NULL);
                ModeState=CONSTANT;             
            }     

            ReturnError=LCD_SetCursorPosAsynch(LCD1,FirstLine,3,NULL);
            ReturnError=LCD_WriteStringAsynch(LCD1,"Stop Watch",10,NULL);
            ReturnError=LCD_SetCursorPosAsynch(LCD1,1,2,NULL);

            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchHours/10,NULL);
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchHours%10,NULL); 
    
            ReturnError=LCD_WriteStringAsynch(LCD1,":",1,NULL);
            
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchMinutes/10,NULL);
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchMinutes%10,NULL);

            ReturnError=LCD_WriteStringAsynch(LCD1,":",1,NULL);
            
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchSeconds/10,NULL);
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchSeconds%10,NULL);

            ReturnError=LCD_WriteStringAsynch(LCD1,":",1,NULL);

            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchTensSeconds/10,NULL);
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchTensSeconds%10,NULL);
        }
}

/* Each 125mS */
void Display_App(void)
{
    /*Prepare to Receive UART Byte Every 125mS*/
    USART_ReceiveBufferAsynchZeroCopy(USART2,&buffer,1,USART_ReceiveCbf);
}

/***********************************************************************************/
/*								User API's Implementations						   */
/***********************************************************************************/

/**
  * @brief  Application Entry Point: Initialized LCD Screen with Main Menu 
  */
void APP_Init(void)
{
    LCD_DisplayMainMenu();
}

#endif
#endif